In [2]:
import pandas as pd
import numpy as np

# 누락 데이터 확인

In [5]:
df = sns.load_dataset('titanic') # 데이터 로드
df.head() # df 첫 5줄 확인

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [6]:
df.info() # df 요약정보 확인

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [8]:
nan_deck = df['deck'].value_counts(dropna=False) # NaN을 포함하여 value의 개수 확인
nan_deck

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [10]:
print(df.isnull(), '\n') # df의 각 컬럼의 값이 NaN이면 True, 아니면 False 반환
print(df.isnull().sum(axis=0), '\n') # df.sinull()의 각 컬럼의 값의 행 기준(세로방향)으로 합계를 출력,True는 1, False는 0이므로 개수와 동일
print(df.notnull(),'\n') # isnull()과 반대
print(df.notnull().sum(axis=0),'\n')

     survived  pclass    sex    age  sibsp  parch   fare  embarked  class  \
0       False   False  False  False  False  False  False     False  False
1       False   False  False  False  False  False  False     False  False
2       False   False  False  False  False  False  False     False  False
3       False   False  False  False  False  False  False     False  False
4       False   False  False  False  False  False  False     False  False
..        ...     ...    ...    ...    ...    ...    ...       ...    ...
886     False   False  False  False  False  False  False     False  False
887     False   False  False  False  False  False  False     False  False
888     False   False  False   True  False  False  False     False  False
889     False   False  False  False  False  False  False     False  False
890     False   False  False  False  False  False  False     False  False

       who  adult_male   deck  embark_town  alive  alone
0    False       False   True        False  False  False
1    False       False  False        False  False  False
2    False       False   True        False  False  False
3    False       False  False        False  False  False
4    False       False   True        False  False  False
..     ...         ...    ...          ...    ...    ...
886  False       False   True        False  False  False
887  False       False  False        False  False  False
888  False       False   True        False  False  False
889  False       False  False        False  False  False
890  False       False   True        False  False  False

[891 rows x 15 columns]

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

     survived  pclass   sex    age  sibsp  parch  fare  embarked  class   who  \
0        True    True  True   True   True   True  True      True   True  True
1        True    True  True   True   True   True  True      True   True  True
2        True    True  True   True   True   True  True      True   True  True
3        True    True  True   True   True   True  True      True   True  True
4        True    True  True   True   True   True  True      True   True  True
..        ...     ...   ...    ...    ...    ...   ...       ...    ...   ...
886      True    True  True   True   True   True  True      True   True  True
887      True    True  True   True   True   True  True      True   True  True
888      True    True  True  False   True   True  True      True   True  True
889      True    True  True   True   True   True  True      True   True  True
890      True    True  True   True   True   True  True      True   True  True

     adult_male   deck  embark_town  alive  alone
0          True  False         True   True   True
1          True   True         True   True   True
2          True  False         True   True   True
3          True   True         True   True   True
4          True  False         True   True   True
..          ...    ...          ...    ...    ...
886        True  False         True   True   True
887        True   True         True   True   True
888        True  False         True   True   True
889        True   True         True   True   True
890        True  False         True   True   True

[891 rows x 15 columns]

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

# 누락 데이터 제거

In [13]:
missing_df = df.isnull() # df의 각 컬럼의 값에 대해 NaN인경우 True, 아니면 False 반환하여 그 값을 가지는 새로운 데이터프레임 생성

for col in missing_df.columns: # missing_df의 모든 컬럼에 대해 반복
    missing_count = missing_df[col].value_counts() # 해당 컬럼의 True와 False값의 개수를 센 결과를 저장
    try:
        print(f'{col} : {missing_count[True]}') # missing_count가 생긴 컬럼에 대해서 해당 문자열 출력
    except:
        print(f'{col} : 0') # missing_count가 생기지 않은 컬럼에 대해 해당 문자열 출력

survived : 0
pclass : 0
sex : 0
age : 177
sibsp : 0
parch : 0
fare : 0
embarked : 2
class : 0
who : 0
adult_male : 0
deck : 688
embark_town : 2
alive : 0
alone : 0

In [14]:
df_thresh = df.dropna(axis=1, # 열 기준(세로방향)
                      thresh=500) # threshold 설정, NaN이 500개 이상이면 삭제

print(df_thresh.columns) # deck 컬럼만 688개이므로 삭제된 결과 확인 가능

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [15]:
df_age = df.dropna(subset=['age'], # 값을 확인하여 판단할 열
                   how='any', # 제거 방법, any이면 하나라도 NaN이면 삭제 all이면 모두 NaN일때 삭제
                   axis=0) # 행 기준(가로방향)

len(df_age) # 총 891개의 행에서 age가 NaN인 177개 행이 삭제된 714개 행만 남음

714

# 누락 데이터 치환

In [53]:
# 평균값으로 치환
df = sns.load_dataset('titanic') # 데이터 로드

print(df['age'].head(10), '\n') # df에서'age' 컬럼의 첫 10줄 확인

mean_age = df['age'].mean() # age 컬럼의 평균값을 새로운 변수에 저장
df['age'].fillna(mean_age, # NaN을 채울 값
                inplace=True) # 원본데이터 변경 여부

print(df['age'].head(10), '\n')

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: age, dtype: float64

In [55]:
# 최빈값으로 치환
df = sns.load_dataset('titanic') # 데이터 로드

print(df['embark_town'][825:830], '\n') # df에서 embark_town 컬럼의 인덱스번호 825부터 829까지의 행을 출력

most_freq = df['embark_town'].value_counts(dropna=True).idxmax() # embark_town 컬럼의 NaN값을 제외하고 value의 개수를 세어최대값의 인덱스를 저장

print(most_freq, '\n')

df['embark_town'].fillna(most_freq, inplace=True)

print(df['embark_town'][825:830], '\n')

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

Southampton

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829    Southampton
Name: embark_town, dtype: object

In [56]:
# 이웃 값으로 치환
df = sns.load_dataset('titanic') # 데이터 로드

print(df['embark_town'][825:830], '\n') # df에서 embark_town 컬럼의 인덱스번호 825부터 829까지의 행을 출력

df['embark_town'].fillna(method='ffill', # 이전 행의 값으로 채우기 (bfill의 경우 다음행의 값으로 채움)
                         inplace=True)

print(df['embark_town'][825:830], '\n')

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829     Queenstown
Name: embark_town, dtype: object

# 참고 : 누락 데이터가 NaN이 아닌 경우

In [51]:
df_cf=pd.DataFrame({'a':[1,2,3,4,5],
                   'b':[1,'.',3,4,5],
                   'c':[1,2,'-',4,5],
                   'd':[1,2,3,np.nan,5],
                   'e':[1,2,3,4,'?']})

# df_cf에는 NaN을 제외한 다른 누락 데이터들이 존재
# 따라서 isnull(), dropna(), fillna() 등을 바로 사용할 수 없음
# replace()를 통해 먼저 누락 데이터들을 NaN으로 통일 시킨 뒤 해당 함수 사용 진행
print(df_cf, '\n')
df_cf.replace(['.','-','?'], np.nan, inplace=True) # 단, 데이터프레임에 replace()메소드는 바꿀 데이터의 값이 입력값과 완전히 같을 경우에만 치환이 수행됨
print(df_cf, '\n')
df_cf.fillna(df_cf.mean(), inplace=True)
print(df_cf, '\n')

   a  b  c    d  e
0  1  1  1  1.0  1
1  2  .  2  2.0  2
2  3  3  -  3.0  3
3  4  4  4  NaN  4
4  5  5  5  5.0  ?

a  b  c  d    e
1  1  1  1.0  1    1
2  .  2  2.0  2    1
3  3  -  3.0  3    1
5  5  5  5.0  ?    1
dtype: int64

   a    b    c    d    e
0  1  1.0  1.0  1.0  1.0
1  2  NaN  2.0  2.0  2.0
2  3  3.0  NaN  3.0  3.0
3  4  4.0  4.0  NaN  4.0
4  5  5.0  5.0  5.0  NaN

   a     b    c     d    e
0  1  1.00  1.0  1.00  1.0
1  2  3.25  2.0  2.00  2.0
2  3  3.00  3.0  3.00  3.0
3  4  4.00  4.0  2.75  4.0
4  5  5.00  5.0  5.00  2.5